       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO_WORLD.
       AUTHOR. IshmamR.
       
       PROCEDURE DIVISION.
           DISPLAY 'HELLO WORLD'.
           STOP RUN.
